tap "homebrew/services"
tap "libsql/sqld"
tap "spring-io/tap"
tap "tursodatabase/tap"
tap "xwmx/taps"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# YAML Parser
brew "libyaml"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Generic library support script
brew "libtool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# X.509 and CMS library
brew "libksba"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Java-based project management
brew "maven"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql@8.0"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk@21"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# General-purpose scripting language
brew "php"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "spring-io/tap/spring-boot"
brew "tursodatabase/tap/turso"
brew "xwmx/taps/nb"
# Terminal-based AI coding assistant
cask "claude-code"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Front-end GUI application for pngquant
cask "pngyu"
# MySQL/MariaDB database management
cask "sequel-ace"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-generate"
cargo "cargo-nih-plug"
npm "@google/gemini-cli"
